In [1]:
import pandas as pd

In [14]:
users = pd.read_csv("Users.csv")
competition = pd.read_csv("Competition.csv")
user_activity = pd.read_csv("UserActivity.csv")
variables = pd.read_csv("VariableDefinitions.csv")
sample = pd.read_csv("SampleSubmission.csv")

In [19]:
sample

     User_ID_Next_month_Activity  Active
0            ID_4TOXNBGB_Month_5       0
1            ID_CHFTIP26_Month_5       0
2            ID_FU5GMWLQ_Month_5       0
3            ID_254TVBQP_Month_5       0
4            ID_4ENO2VFE_Month_5       0
...                          ...     ...
1335         ID_PI8N2KJX_Month_5       0
1336         ID_L9AHTUD7_Month_5       0
1337         ID_BB7GLV87_Month_5       0
1338         ID_WB6O1NFS_Month_5       0
1339         ID_99LD9C1B_Month_5       0

[1340 rows x 2 columns]

In [13]:
variables.head()

              VariableName                                 VariableDefinition
0                 Comments                                                NaN
1                   UserID  This is the unique ID of the user who made the...
2         CommentDate Year  The year the comment was made in. Years are in...
3        CommentDate Month  The month of the year the comment was made in....
4  CommentDate Day_of_week  The day of the week the comment was made on. D...

In [3]:
users

,FeatureX,FeatureY,User_ID,Countries_ID,Created At time,Created At Year,Created At Month,Created At Day_of_month
0,0,0,ID_DC6S4E9O,X9GR,19:33:13.663391,1,1,16
1,1,0,ID_E8S97OUT,X9GR,22:18:18.228921,1,12,27
2,0,0,ID_QZ1HASL3,X9GR,23:13:03.266635,1,1,1
3,1,0,ID_SDV9Q3E9,X9GR,09:50:09.697573,1,12,27
4,1,0,ID_W942LN7F,X9GR,13:33:06.531662,1,1,16
...,...,...,...,...,...,...,...,...
12408,0,1,ID_C5393PD0,7DKX,05:02:39.352427,1,11,6
12409,0,1,ID_QX7XRT0C,K4DG,02:50:19.027320,1,3,25
12410,0,1,ID_RGN2RK66,ONON,22:06:33.713692,1,12,7
12411,0,0,ID_XZS1QE0W,3YQR,06:56:02.570173,1,5,27
12412,0,1,ID_8K4FGJYO,G4PG,10:22:54.369939,1,12,5

In [5]:
competition

,FeatureA,FeatureB,FeatureC,FeatureD,FeatureE,SecretCode,FeatureF,FeatureG,FeatureH,FeatureI,Country_ID,Comp_ID,End Time time,End Time Year,End Time Month,End Time Day_of_month,Start Time time,Start Time Year,Start Time Month,Start Time Day_of_month
0,"[2, 4]",[14],15.0,0,2,1,[3],[],[],NaN,G3F0,ID_AU0T,21:05:00,2.0,6.0,19.0,07:00:00,2,6,19
1,[1],[],3.0,0,3,1,[1],[],[1],3.0,0Q35,ID_O21T,15:30:00,2.0,2.0,15.0,12:00:00,2,2,1
2,[1],[9],2.0,0,2,1,"[1, 5]",[5],[1],2.0,EGI9,ID_W6XE,21:59:00,2.0,5.0,9.0,08:00:00,2,3,28
3,[],[],1.0,0,2,1,[1],[4],[],NaN,NaN,ID_A2FN,12:00:00,2.0,6.0,22.0,12:00:00,2,6,12
4,[],[6],NaN,0,2,0,[],[4],[2],9.0,NaN,ID_X0PD,23:59:00,2.0,5.0,31.0,09:00:00,2,5,27
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
242,[],[],NaN,1,2,0,[2],[5],[2],NaN,NaN,ID_GR92,15:00:00,1.0,2.0,1.0,05:00:00,1,1,1
243,[1],[],2.0,1,2,0,[1],[5],[1],2.0,NaN,ID_8BH9,23:59:00,1.0,6.0,27.0,15:00:00,1,6,1
244,[1],[],NaN,0,2,1,[1],[3],[],NaN,H03V,ID_IHRZ,17:00:00,1.0,10.0,20.0,08:57:00,1,10,19
245,[1],[],25.0,0,2,1,[1],[5],[2],NaN,EGI9,ID_CMWO,12:00:00,1.0,5.0,31.0,12:00:00,1,5,1
246,[1],[],2.0,0,2,0,[3],[3],[2],2.0,ZEWU,ID_OAR6,23:59:00,1.0,4.0,4.0,11:00:00,1,4,2

In [7]:
user_activity

,User_ID,Title,datetime time,datetime Year,datetime Month,datetime Day_of_month
0,ID_RT43AK77,comp_ID_IV5D,22:00:38,1,11,22
1,ID_RT43AK77,comp_ID_IV5D,00:41:02,1,11,23
2,ID_RT43AK77,comp_ID_IV5D,00:53:15,1,11,23
3,ID_RT43AK77,comp_ID_IV5D,01:23:05,1,11,23
4,ID_RT43AK77,comp_ID_IV5D,01:27:38,1,11,23
...,...,...,...,...,...,...
317287,ID_Z759BCS3,job_ID_5ONI,07:14:47,1,11,14
317288,ID_WNJMADF8,job_ID_5ONI,06:24:46,1,11,14
317289,ID_7NBY9MV2,job_ID_5ONI,11:56:35,1,11,20
317290,ID_LHPJJSOK,job_ID_5ONI,01:27:13,1,11,14
317291,ID_LCFNGARD,job_ID_5ONI,08:40:29,1,11,17